package com.ljy.day22.中文乱码出现的情况研究;

import java.io.IOException;

/**
 * 
 * <pre>
 * 中文乱码出现的情况研究
 * 注意点:乱码解决的办法是再编码,
 * 但是,如果是编码出错,无法解决,如果是解码出错可以利用再编码再解码解决
 * 
 * 编码:      |     解码:       |      结果
 * ----------|----------------|------------------------------------------------------------
 * GBK	     |	   UTF-8	  |     再用utf8编码,gbk解码,最后结果是乱码   不可以(gbk两个字节,utf83个字节)
 * ----------|----------------|------------------------------------------------------------  
 * GBK       |     ISO8859-1  |     再用ISO8859-1编码,gbk解码,结果不是乱码   可以
 * ----------|----------------|------------------------------------------------------------
 * TUF-8     |	   GBK        |     再用GBK编码,TUF-8解码,最小公倍数时可以,否则不可以
 * ----------|----------------|------------------------------------------------------------
 * UTF-8     |     ISO8859-1  |     再用ISO8859-1编码,UTF-8解码
 * ----------|----------------|---------------------
 * ISO8859-1 |     UTF-8	  |     不可以(编码出错)
 * ----------|----------------|--------------------
 * ISO8859-1 |     GBK        |     你可以(编码出错)
 * </pre>
 * @author lijiayan_mail@163.com
 * @createTime 2018年3月27日
 */
public class Demo5 {
	public static void main(String[] args) throws IOException {
		String s1 = "你好";
		byte[] s1b = s1.getBytes();//utf8编码
		String sr1b = new String(s1b,"gbk");//jbk解码
		System.out.println(sr1b);
		//在编码
		byte[] s1bb = sr1b.getBytes("gbk");//jbk编码
		System.out.println(new String(s1bb,"utf-8"));//utf8解码
	}
}
